dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_03_100_tqfp.c
/* Connections for: sdhc_card_detect_n */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_detect_n[1] = {
    {P2_6, &CY_SDHC_0, CY_PIN_IN_FUNCTION(P2_6_SDHC0_CARD_DETECT_N)},
};

/* Connections for: sdhc_card_if_pwr_en */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_if_pwr_en[1] = {
    {P3_1, &CY_SDHC_0, CY_PIN_OUT_FUNCTION(P3_1_SDHC0_CARD_IF_PWR_EN)},
};

/* Connections for: sdhc_card_mech_write_prot */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_card_mech_write_prot[1] = {
    {P2_7, &CY_SDHC_0, CY_PIN_IN_FUNCTION(P2_7_SDHC0_CARD_MECH_WRITE_PROT)},
};

/* Connections for: sdhc_clk_card */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_clk_card[1] = {
    {P2_5, &CY_SDHC_0, CY_PIN_OUT_BUF_FUNCTION(P2_5_SDHC0_CLK_CARD)},
};

/* Connections for: sdhc_io_volt_sel */
const cy_resource_pin_mapping_t cy_pin_map_sdhc_io_volt_sel[1] = {
    {P3_0, &CY_SDHC_0, CY_PIN_OUT_FUNCTION(P3_0_SDHC0_IO_VOLT_SEL)},
};

/* Connections for: smif_spi_clk */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_clk[1] = {
    {P11_7, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_7_SMIF_SPI_CLK)},
};

/* Connections for: smif_spi_data0 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data0[1] = {
    {P11_6, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_6_SMIF_SPI_DATA0)},
};

/* Connections for: smif_spi_data1 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data1[1] = {
    {P11_5, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_5_SMIF_SPI_DATA1)},
};

/* Connections for: smif_spi_data2 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data2[1] = {
    {P11_4, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_4_SMIF_SPI_DATA2)},
};

/* Connections for: smif_spi_data3 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_data3[1] = {
    {P11_3, &CY_SMIF_0, CY_PIN_OUT_BUF_FUNCTION(P11_3_SMIF_SPI_DATA3)},
};

/* Connections for: smif_spi_select0 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select0[1] = {
    {P11_2, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_2_SMIF_SPI_SELECT0)},
};

/* Connections for: smif_spi_select1 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select1[1] = {
    {P11_1, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_1_SMIF_SPI_SELECT1)},
};

/* Connections for: smif_spi_select2 */
const cy_resource_pin_mapping_t cy_pin_map_smif_spi_select2[1] = {
    {P11_0, &CY_SMIF_0, CY_PIN_OUT_FUNCTION(P11_0_SMIF_SPI_SELECT2)},
};

/* Connections for: tcpwm_line */
const cy_resource_pin_mapping_t cy_pin_map_tcpwm_line[64] = {
    {P0_0, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P0_0_TCPWM0_LINE0)},
    {P0_0, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P0_0_TCPWM1_LINE0)},
    {P0_2, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P0_2_TCPWM0_LINE1)},
    {P0_2, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P0_2_TCPWM1_LINE1)},
    {P0_4, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P0_4_TCPWM0_LINE2)},
    {P0_4, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P0_4_TCPWM1_LINE2)},
    {P2_0, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P2_0_TCPWM0_LINE3)},
    {P2_0, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P2_0_TCPWM1_LINE3)},
    {P2_2, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P2_2_TCPWM0_LINE0)},
    {P2_2, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P2_2_TCPWM1_LINE4)},
    {P2_4, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P2_4_TCPWM0_LINE1)},
    {P2_4, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P2_4_TCPWM1_LINE5)},
    {P2_6, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P2_6_TCPWM0_LINE2)},
    {P2_6, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P2_6_TCPWM1_LINE6)},
    {P3_0, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P3_0_TCPWM0_LINE3)},
    {P3_0, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P3_0_TCPWM1_LINE7)},
    {P5_0, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P5_0_TCPWM0_LINE0)},
    {P5_0, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P5_0_TCPWM1_LINE0)},
    {P5_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P5_6_TCPWM0_LINE1)},
    {P5_6, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P5_6_TCPWM1_LINE1)},
    {P6_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P6_0_TCPWM0_LINE2)},
    {P6_0, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P6_0_TCPWM1_LINE2)},
    {P6_2, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P6_2_TCPWM0_LINE3)},
    {P6_2, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P6_2_TCPWM1_LINE3)},
    {P6_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P6_4_TCPWM0_LINE0)},
    {P6_4, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P6_4_TCPWM1_LINE4)},
    {P6_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P6_6_TCPWM0_LINE1)},
    {P6_6, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P6_6_TCPWM1_LINE5)},
    {P7_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P7_0_TCPWM0_LINE2)},
    {P7_0, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P7_0_TCPWM1_LINE6)},
    {P7_2, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P7_2_TCPWM0_LINE3)},
    {P7_2, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P7_2_TCPWM1_LINE7)},
    {P7_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P7_4_TCPWM0_LINE0)},
    {P7_4, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P7_4_TCPWM1_LINE0)},
    {P7_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P7_6_TCPWM0_LINE1)},
    {P7_6, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P7_6_TCPWM1_LINE1)},
    {P8_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P8_0_TCPWM0_LINE2)},
    {P8_0, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P8_0_TCPWM1_LINE2)},
    {P8_2, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P8_2_TCPWM0_LINE3)},
    {P8_2, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P8_2_TCPWM1_LINE3)},
    {P9_0, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P9_0_TCPWM0_LINE0)},
    {P9_0, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P9_0_TCPWM1_LINE4)},
    {P9_2, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P9_2_TCPWM0_LINE1)},
    {P9_2, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P9_2_TCPWM1_LINE5)},
    {P10_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P10_0_TCPWM0_LINE2)},
    {P10_0, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P10_0_TCPWM1_LINE6)},
    {P10_2, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P10_2_TCPWM0_LINE3)},
    {P10_2, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P10_2_TCPWM1_LINE7)},
    {P10_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P10_4_TCPWM0_LINE0)},
    {P10_4, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P10_4_TCPWM1_LINE0)},
    {P10_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P10_6_TCPWM0_LINE1)},
    {P10_6, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P10_6_TCPWM1_LINE1)},
    {P11_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P11_0_TCPWM0_LINE2)},
    {P11_0, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P11_0_TCPWM1_LINE2)},
    {P11_2, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P11_2_TCPWM0_LINE3)},
    {P11_2, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P11_2_TCPWM1_LINE3)},
    {P11_4, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P11_4_TCPWM0_LINE0)},
    {P11_4, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P11_4_TCPWM1_LINE4)},
    {P11_6, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P11_6_TCPWM0_LINE1)},
    {P11_6, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P11_6_TCPWM1_LINE5)},
    {P12_0, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P12_0_TCPWM0_LINE2)},
    {P12_0, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P12_0_TCPWM1_LINE6)},
    {P12_6, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P12_6_TCPWM0_LINE3)},
    {P12_6, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P12_6_TCPWM1_LINE7)},
};

/* Connections for: tcpwm_line_compl */
const cy_resource_pin_mapping_t cy_pin_map_tcpwm_line_compl[64] = {
    {P0_1, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P0_1_TCPWM0_LINE_COMPL0)},
    {P0_1, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P0_1_TCPWM1_LINE_COMPL0)},
    {P0_3, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P0_3_TCPWM0_LINE_COMPL1)},
    {P0_3, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P0_3_TCPWM1_LINE_COMPL1)},
    {P0_5, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P0_5_TCPWM0_LINE_COMPL2)},
    {P0_5, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P0_5_TCPWM1_LINE_COMPL2)},
    {P2_1, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P2_1_TCPWM0_LINE_COMPL3)},
    {P2_1, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P2_1_TCPWM1_LINE_COMPL3)},
    {P2_3, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P2_3_TCPWM0_LINE_COMPL0)},
    {P2_3, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P2_3_TCPWM1_LINE_COMPL4)},
    {P2_5, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P2_5_TCPWM0_LINE_COMPL1)},
    {P2_5, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P2_5_TCPWM1_LINE_COMPL5)},
    {P2_7, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P2_7_TCPWM0_LINE_COMPL2)},
    {P2_7, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P2_7_TCPWM1_LINE_COMPL6)},
    {P3_1, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P3_1_TCPWM0_LINE_COMPL3)},
    {P3_1, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P3_1_TCPWM1_LINE_COMPL7)},
    {P5_1, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P5_1_TCPWM0_LINE_COMPL0)},
    {P5_1, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P5_1_TCPWM1_LINE_COMPL0)},
    {P5_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P5_7_TCPWM0_LINE_COMPL1)},
    {P5_7, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P5_7_TCPWM1_LINE_COMPL1)},
    {P6_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P6_1_TCPWM0_LINE_COMPL2)},
    {P6_1, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P6_1_TCPWM1_LINE_COMPL2)},
    {P6_3, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P6_3_TCPWM0_LINE_COMPL3)},
    {P6_3, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P6_3_TCPWM1_LINE_COMPL3)},
    {P6_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P6_5_TCPWM0_LINE_COMPL0)},
    {P6_5, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P6_5_TCPWM1_LINE_COMPL4)},
    {P6_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P6_7_TCPWM0_LINE_COMPL1)},
    {P6_7, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P6_7_TCPWM1_LINE_COMPL5)},
    {P7_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P7_1_TCPWM0_LINE_COMPL2)},
    {P7_1, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P7_1_TCPWM1_LINE_COMPL6)},
    {P7_3, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P7_3_TCPWM0_LINE_COMPL3)},
    {P7_3, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P7_3_TCPWM1_LINE_COMPL7)},
    {P7_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P7_5_TCPWM0_LINE_COMPL0)},
    {P7_5, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P7_5_TCPWM1_LINE_COMPL0)},
    {P7_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P7_7_TCPWM0_LINE_COMPL1)},
    {P7_7, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P7_7_TCPWM1_LINE_COMPL1)},
    {P8_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P8_1_TCPWM0_LINE_COMPL2)},
    {P8_1, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P8_1_TCPWM1_LINE_COMPL2)},
    {P8_3, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P8_3_TCPWM0_LINE_COMPL3)},
    {P8_3, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P8_3_TCPWM1_LINE_COMPL3)},
    {P9_1, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P9_1_TCPWM0_LINE_COMPL0)},
    {P9_1, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P9_1_TCPWM1_LINE_COMPL4)},
    {P9_3, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P9_3_TCPWM0_LINE_COMPL1)},
    {P9_3, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P9_3_TCPWM1_LINE_COMPL5)},
    {P10_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P10_1_TCPWM0_LINE_COMPL2)},
    {P10_1, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P10_1_TCPWM1_LINE_COMPL6)},
    {P10_3, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P10_3_TCPWM0_LINE_COMPL3)},
    {P10_3, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P10_3_TCPWM1_LINE_COMPL7)},
    {P10_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P10_5_TCPWM0_LINE_COMPL0)},
    {P10_5, &CY_TCPWM_1_0, CY_PIN_OUT_FUNCTION(P10_5_TCPWM1_LINE_COMPL0)},
    {P10_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P10_7_TCPWM0_LINE_COMPL1)},
    {P10_7, &CY_TCPWM_1_1, CY_PIN_OUT_FUNCTION(P10_7_TCPWM1_LINE_COMPL1)},
    {P11_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P11_1_TCPWM0_LINE_COMPL2)},
    {P11_1, &CY_TCPWM_1_2, CY_PIN_OUT_FUNCTION(P11_1_TCPWM1_LINE_COMPL2)},
    {P11_3, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P11_3_TCPWM0_LINE_COMPL3)},
    {P11_3, &CY_TCPWM_1_3, CY_PIN_OUT_FUNCTION(P11_3_TCPWM1_LINE_COMPL3)},
    {P11_5, &CY_TCPWM_0_0, CY_PIN_OUT_FUNCTION(P11_5_TCPWM0_LINE_COMPL0)},
    {P11_5, &CY_TCPWM_1_4, CY_PIN_OUT_FUNCTION(P11_5_TCPWM1_LINE_COMPL4)},
    {P11_7, &CY_TCPWM_0_1, CY_PIN_OUT_FUNCTION(P11_7_TCPWM0_LINE_COMPL1)},
    {P11_7, &CY_TCPWM_1_5, CY_PIN_OUT_FUNCTION(P11_7_TCPWM1_LINE_COMPL5)},
    {P12_1, &CY_TCPWM_0_2, CY_PIN_OUT_FUNCTION(P12_1_TCPWM0_LINE_COMPL2)},
    {P12_1, &CY_TCPWM_1_6, CY_PIN_OUT_FUNCTION(P12_1_TCPWM1_LINE_COMPL6)},
    {P12_7, &CY_TCPWM_0_3, CY_PIN_OUT_FUNCTION(P12_7_TCPWM0_LINE_COMPL3)},
    {P12_7, &CY_TCPWM_1_7, CY_PIN_OUT_FUNCTION(P12_7_TCPWM1_LINE_COMPL7)},
};

#endif
